[
  {
    "id": 1,
    "poster": "Films photo/Photo1.png",
    "title": "Люблю тебе ненавидіти",
    "description": "Після незабутнього першого побачення успішний фінансовий аналітик Бен і молода студентка юридичного факультету Бі здаються ідеальною парою, проте шалена пристрасть перетворюється на взаємну ненависть та зневагу. Через деякий час хлопець і дівчина перетинаються на весіллі сестри Бі в Австралії. Перебуваючи під тиском непростих обставин, Бен і Бі вирішують на час урочистостей прикинутися закоханою парою. У міру здійснення свого плану двоє переживають комічні пригоди та починаються закохуватися по-справжньому...",
    "genre": ["Романтична кінокомедія"],
    "rating": 4.5,
    "year": 2023,
    "trailer": "https://www.youtube.com/watch?v=j3NG4NI93qA",
    "cast": ["Сідні Свіні", "Глен Павелл", "Александра Шіпп", "ГаТа", "Гедлі Робінсон", "Мішель Герд", "Дермот Малруні", "Рейчел Гріффітс", "Брайан Браун", "Чарлі Фрейзер"]
  },
  {
    "id": 2,
    "poster": "Films photo/Photo2.png",
    "title": "Містер і місіс Сміт",
    "description": "Джон і Джейн Сміти — звичайна сімейна пара. Вони одружені вже не перший рік, і, здавалося б, досконально знають одне одного. Перед усім світом вони зберігають ореол респектабельності, проте тепер вони не схожі на самих себе в ті часи, коли тільки зустрілися одне з одним. В ті часи пристрасть штовхнула їх в обійми одне одного, тоді як зараз їм нудно разом, і в їхньому житті немає місця несподіванкам. Але насправді і Джон, і Джейн — наймані вбивці, і кращі в своїй області. Вони приховують це одне від одного, до тих пір, поки не стикаються під час виконання одного завдання для конкуруючих між собою організацій. Їх інкогніто розкрито і тепер вони отримують від своїх босів завдання на ліквідацію одне одного...",
    "genre": ["Екшн", "Комедія", "Кримінал", "Трилери", "Романтичні"],
    "rating": 4.6,
    "year": 2005,
    "trailer": "https://www.youtube.com/watch?v=m-MSPAWu7Sw",
    "cast": ["Бред Пітт", "Анджеліна Джолі", "Вінс Вон", "Адам Броуді", "Кері Вашингтон", "Кіт Девід", "Кріс Вайц", "Рейчел Гантлі"]
  },
  {
    "id": 3,
    "poster": "Films photo/Photo3.png",
    "title": "Дюна",
    "description": "Пустельна планета Арракіс — єдине джерело найважливішої спеції на світі, необхідної для космічних польотів. Великі Будинки галактичної імперії вступають в боротьбу за Арракіс. Початком війни, здатної змінити світ, стає указ імператора, який забирає Дюну у барона Харконнена і передає під управління благородного герцога Лето Атріда. У центрі війни виявляється юний Пол — син герцога Лето і леді Джессіки з сестринського ордену, що володіє таємним знанням. Після прибуття на Арракіс і знайомства з бунтівним народом фременів Полу належить довести або спростувати чутки про свою роль обраного. Вороги наносять удар першими, але і його час настав.",
    "genre": ["Драма", "Фантастика", "Бойовик", "Пригоди"],
    "rating": null,
    "year": 2021,
    "trailer": "https://www.youtube.com/watch?v=Ljzu52GMytk",
    "cast": ["Тімоті Шаламе", "Ребекка Фергюсон", "Оскар Айзек", "Джейсон Момоа", "Зендея", "Стеллан Скарсгард", "Хав'єр Бардем", "Дейв Батіста"]
  },
  {
    "id": 4,
    "poster": "Films photo/Photo4.png",
    "title": "Дюна: Частина друга",
    "description": "Молодий герцог Пол Атрід, що має дар ясновидіння, дивом переживає замах на свою сім'ю, після чого разом з матір'ю, леді Джессікою, ховається від переслідування серед безмежної пустелі. Двоє знаходять безпечний притулок у таборі фременів — волелюбного народу, який за багато століть пристосувався до життя у суворих умовах планети Арракіс. Пол зустрічає там своє кохання на ім'я Чані, намагається помститися змовникам за вбивство сім'ї, а також приймає свою долю Квізац Хедераха — месії, якому необхідно привести людство до кращого майбутнього.",
    "genre": ["Драма", "Фантастика", "Бойовик", "Пригоди"],
    "rating": 3.6,
    "year": 2024,
    "trailer": "https://www.youtube.com/watch?v=DtR76pz517E",
    "cast": ["Тімоті Шаламе", "Зендея", "Ребекка Фергюсон", "Хав'єр Бардем", "Джош Бролін", "Остін Батлер", "Флоренс П'ю", "Дейв Батіста", "Крістофер Вокен", "Леа Сейду"]
  },
  {
    "id": 5,
    "poster": "Films photo/Photo5.png",
    "title": "Пригоди Паддінгтона в Перу",
    "description": "Паддінгтон у супроводі сім'ї Браун вирушає з Лондона до рідних тропічних лісів Південної Америки, щоб відвідати в заповіднику для літніх ведмедів свою тітку Люсі, яка за ним сильно сумує. Довгоочікуваної зустрічі не відбувається, оскільки незадовго до їх прибуття літня ведмедиця загадковим чином зникає, залишивши у своїй хатині лише окуляри та браслет. Все вказує на те, що тітка Люсі пішла в джунглі, щоб знайти легендарне загублене місто Ельдорадо. Вирушивши її слідами, головні герої об'єднують зусилля з капітаном річкового судна Гантером Кеботом і його дочкою Джиною...",
    "genre": ["Комедія", "Детектив", "Сімейний", "Пригоди"],
    "rating": 4.4,
    "year": 2024,
    "trailer": "https://www.youtube.com/watch?v=6a55VfAkrH4",
    "cast": ["Бен Вішоу", "Г'ю Бонневілль", "Емілі Мортімер", "Меделін Гарріс", "Семюел Джослін", "Джулі Волтерс", "Антоніо Бандерас", "Карла Тоус", "Джим Бродбент"]
  },
  {
    "id": 6,
    "poster": "Films photo/Photo6.png",
    "title": "Оппенгеймер",
    "description": "У розпал Другої світової війни полковник США Леслі Гровс призначає блискучого фізика-теоретика Роберта Оппенгеймера науковим керівником Манхеттенського проєкту. Вся індустріальна міць та інноваційні технології країни йдуть на те, щоб випередити нацистську Німеччину у створенні зброї масового знищення на основі розщеплення ядра атома. Оппенгеймер проводить успішні випробування першої у світі ядерної бомби, що дозволяє наблизити перемогу у війні. Проте чоловіка мучать докори совісті, оскільки його винахід здатний призвести до знищення всього людства...",
    "genre": ["Драма", "Історичний", "Біографічний"],
    "rating": 4.6,
    "year": 2023,
    "trailer": "https://www.youtube.com/watch?v=eZYD5NRum4A",
    "cast": ["Кілліан Мерфі", "Емілі Блант", "Метт Деймон", "Роберт Дауні мол.", "Флоренс П'ю", "Джош Гартнетт", "Кейсі Аффлек", "Рамі Малек", "Кеннет Брана", "Бенні Сефді"]
  },
  {
    "id": 7,
    "poster": "Films photo/Photo7.png",
    "title": "Круелла",
    "description": "До того, як стати відомою злочинницею з пристрастю до одягу з собачих шкур, Круелла Де Віль була відома як Естелла. На початку 1970-х років осиротіла дівчинка животіла на вулицях Лондона, дружила з кишеньковими злодіями, жила за рахунок дрібних крадіжок і мріяла створювати одяг. Одного разу Естеллі посміхається удача: вона стає ученицею лондонського модельєра — шикарної і лякаюче зарозумілої баронеси фон Геллман. Але коли здається, що мрії Естелли ось-ось здійсняться, вона зіштовхується зі своїм трагічним минулим.",
    "genre": ["Комедія", "Кримінал"],
    "rating": 4.7,
    "year": 2021,
    "trailer": "https://www.youtube.com/watch?v=sy9S2_YOfuw",
    "cast": ["Емма Стоун", "Емма Томпсон", "Джоель Фрай", "Пол Волтер Гаузер", "Джон МакКрі", "Емілі Бічем", "Марк Стронг", "Кайван Новак", "Джемі Деметріу"]
  },
  {
    "id": 8,
    "poster": "Films photo/Photo8.png",
    "title": "Барбі",
    "description": "У казковому Барбіленді проживає безліч впевнених у собі та безтурботних ляльок, які вірять, що роблять людських дівчаток щасливими. У той час як різні версії Барбі займають найважливіші посади: лікарів, юристів, письменників і навіть президента, чоловічі ляльки на ім'я Кен здебільшого просто веселяться і проводять час на пляжі. Одного разу стереотипна Барбі починає переживати екзистенційну кризу, після чого у супроводі Кена вирушає у реальний світ, щоб знайти джерело свого дивного занепокоєння.",
    "genre": ["Комедія", "Фентезі", "Пригоди"],
    "rating": 4.2,
    "year": 2023,
    "trailer": "https://www.youtube.com/watch?v=K9cibjqbcBQ",
    "cast": ["Марго Роббі", "Райан Гослінг", "Америка Феррера", "Аріана Грінблатт", "Кейт МакКіннон", "Ісса Рей", "Рі Перлман", "Вілл Феррелл", "Майкл Сера"]
  },
  {
    "id": 9,
    "poster": "Films photo/Photo9.png",
    "title": "Диявол носить «Прада»",
    "description": "Енді Сакс мріє стати серйозним журналістом, але випускниці університету без досвіду непросто потрапити на роботу в солідне видання. Коли на її резюме приходить відгук з журналу мод, Енді знехотя погоджується на співбесіду. Їй не дуже хочеться працювати асистентом редактора Міранди Прістлі, але цей досвід може стати в нагоді для майбутньої кар'єри. Дівчина зовсім не розбирається в моді, але якимось дивом Міранда бере її на випробувальний термін. Міранда Прістлі дуже вимоглива і строга, вона тримає в страху і напрузі всіх підлеглих. З першого дня Енді все робить неправильно, щохвилини викликаючи невдоволення редакторки. Розуміючи, що знаходиться на межі звільнення, дівчина вирішує змінити ситуацію...",
    "genre": ["Драма", "Комедія"],
    "rating": 4.8,
    "year": 2006,
    "trailer": "https://www.youtube.com/watch?v=1MdB1ohntqM",
    "cast": ["Меріл Стріп", "Енн Гетевей", "Емілі Блант", "Стенлі Туччі", "Саймон Бейкер", "Едріан Греньє", "Трейсі Томс", "Річ Соммер"]
  },
  {
    "id": 10,
    "poster": "Films photo/Photo10.png",
    "title": "Сам удома",
    "description": "Восьмирічний Кевін МакКалістер мріє лише про одне — залишитися на самоті, без обридлих братів і сестер. Як не дивно, вранці він прокидається у порожньому будинку. Родина, забувши про нього, полетіла до Європи на різдвяні канікули. Переконавшись, що його бажання збулося, Кевін починає відриватися на повну. Але безконтрольним веселощам приходить кінець, коли будинок вирішують пограбувати двоє дрібних шахраїв Гаррі та Марв. «Мокрі» бандити не бачать небезпеки в дитині і сподіваються добре поживитися у величезному будинку. Кевіну не залишається нічого іншого, як підготуватися до їх приходу, перетворивши будинок на неприступну фортецю.",
    "genre": ["Комедія", "Сімейний"],
    "rating": 4.4,
    "year": 1990,
    "trailer": "https://www.youtube.com/watch?v=Pkw6wwvY3JU",
    "cast": ["Маколей Калкін", "Джо Пеші", "Деніел Стерн", "Джон Герд", "Роберт Блоссом", "Катрін О'Гара", "Анджела Ґеаталс", "Девін Ретрей", "Ґеррі Беммен", "Гілларі Вулф"]
  }
]